{
  "list": [
    {
      "title": "TruQC",
      "url": "http://truqcapp.com",
      "description": ""
    },
    {
      "title": "Tommy O'Connor Portfolio",
      "url": "http://tommy-oconnor.com",
      "description": ""
    },
    {
      "title": "Hiring Flagstaff",
      "url": "http://hiringflagstaff.com",
      "description": "Hiring Flagstaff is a unified platform to promote jobs, internships, and other services to jobseekers, free for any business in Northern Arizona,. It is also designed to introduce Trailing Partners -- people who are unemployed and unable to find work with an employed spouse -- to local businesses, large and small.\n\nMy role as the sole developer is to bring the entire project from design to launch and includes: Database modeling and construction (MySQL), configuring a LAMP server with automation scripting, evaluating and addressing security concerns, and setting up routine transactional email services. On the front end, I have worked closely with the [Made With Math](http://madewithmath.com/) team's designer and project manager to actualize the mockups into usable code.\n\nThe project is facilitated through the [Greater Flagstaff Chamber of Commerce](http://www.flagstaffchamber.com/) and funded in-part through generous industry sponsors. It is scheduled for a Fall 2016 launch, currently undergoing quality control, testing, and marketing efforts.\n Please check in soon for a post-launch update!"
    },
    {
      "title": "Earth Color",
      "url": "http://earthcolor.com",
      "description": ""
    },
    {
      "title": "The Arboretum at Flagstaff",
      "url": "http://www.thearb.org"
    },
    {
      "title": "Karma Sushi Bar Grill",
      "url": "http://www.karmaflagstaff.com",
      "description": "Sashimi, seaweed salad, and sake...an incredible treat in the high desert. I collaborated with the wonderful [Darcy Falk](http://darcyfalk.com/), [Jen Saunders](http://www.jensaunders.com), and [Darryl Brown](http://www.2bdesign.us) to bring the responsive website to production.\n\nBuilt with Yii, a Rails-like PHP MVC application framework, this project began as a customer-facing platform for practical, business related information. After it's release in early 2015, I continued to maintain the website and introduce new features such as an employee portal for job orientation, training, and communication."
    },
    {
      "title": "FLG Terrior",
      "url": "http://www.flgterroir.com",
      "description": ""
    },
    {
      "title": "HelpTile",
      "url": "http://helptile.com",
      "description": "When life gives you oppportunities, make the most of them! [HelpTile](http://helptile.com) is a Flagstaff, Arizona start-up company. The chief product is a Internet browser-based extension that gives users the power to be specific when they share Internet content with friends.\n\n![Demonstration of publishing a Tile with HelpTile](/img/helptile.gif)\n\nThe extension is used to point-to, or \"tag\", the parts of a webpage that matter most. Users share a URL with others that goes back to the tagged webpage...but once we land on the webpage, the user is immediately taken to the specific image, paragraph, sentence, or word. It's granular!\n\nDuring my six months with the HelpTile team, I wore a lot of hats. As the first full-time employee, after the three founders, I had major input on the Product Design and Front-end Development.\n\nAs a Designer, I translated the goals generated by our weekly sprints into pencil-and-paper designs. These designs were reviewed, modified, and eventually taken to digital wireframes. I had the pleasure of working with [Tommy O'Connor](http://madewithmath.com), the Lead Designer and mentor to me.\n\nWith detailed wireframe/mockups in hand, I returned to the Developer's Cave. [Darryl Brown](http://www.darrylivanbrown.com) guided the other devs and myself into the wonderful world of modern Javascript, NPM, asynchronisity, and general hacking goodness.\n\n[React](https://facebook.github.io/react/) saved the day for our state-driven extension. Styles were written in [SASS](http://sass-lang.com) and we utilized Grunt to take care of all the automation and task-running. I got my feet wet writing functional tests (using [Mocha](https://mochajs.org/) / [Jasmine](https://jasmine.github.io/)) which simulated user interactions in multiple browser environments to ensure consistent experiences. Behind the scenes, our application communicated with a REST-ful API maintained in PHP."
    },
    {
      "title": "Mountain Sports Flagstaff",
      "url": "http://mountainsportsflagstaff.com",
      "description": "Located in the heart of downtown, Mountain Sports Flagstaff is an established local retail business and advocate for outdoor activities in Northern Arizona. The website is built on Wordpress and utilizes the frequent Instagram feed of owner Lisa Lamberson. In addition to business details, history, and team profile is a an online store for swag, fundraisers, and other lifestyle products."
    },
    {
      "title": "KLB Insurance",
      "url": "http://klbinsurance.net"
    },
    {
      "title": "Ecoss",
      "url": "http://ecoss.nau.edu",
      "description": "The Center for Ecosystem Science and Society is an environmental research department at Northern Arizona University. Originally built in the Spring of 2015, this is a Wordpress website with a number of custom plugins to manage their dynamic content pipeline."
    },
    {
      "title": "Ceiba Adventures",
      "url": "http://ceibaadventures.com",
      "description": ""
    },
    {
      "title": "Diablo Burger",
      "url": "http://diabloburger.com"
    }
  ]
}